Revit 2027 API
PointCloudEngineRegistry.GetSupportedEngines Method
 Returns a list of the identifiers supported by point cloud engines registered to Revit.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> GetSupportedEngines()
Public Shared Function GetSupportedEngines As IList(Of String)
public:
static IList<String^>^ GetSupportedEngines()
static member GetSupportedEngines : unit -> IList<string>
Return Value
IList<String>
 The list of identifiers.
See Also
Reference
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace